plants = [
	{
		"id": 2,
		"name": "豌豆射手",
		"description": "豌豆射手，你的第一道防线。它们通过发射豌豆来攻击僵尸。",
		"toughness": 300,
		"power": "20×1点/1.4s",
		"range": "前方整行",
		"characteristics": "---",
		"desc": "一棵植物，怎么能如此快地生长，并发射如此多的豌豆呢？豌豆射手：“努力工作，奉献自己，再加上一份阳光，高纤维和氧化碳均衡搭配，这种健康早餐让一切成为可能。”"
	},
	{
		"id": 1,
		"name": "向日葵",
		"description": "向日葵，为你生产额外阳光的经济作物。尝试尽可能多的种植吧！",
		"toughness": 300,
		"power": "---",
		"range": "---",
		"characteristics": "每24s生产25点阳光",
		"desc": "向日葵情不自禁地和着节拍起舞。是什么节拍呢？嗨，是大地自己用来提神的爵士节拍，这种频率的节拍，只有向日葵才能听到。"
	},
	{
		"id": 3,
		"name": "坚果",
		"description": "坚果拥有足以让你保护其它植物的坚硬外壳。",
		"toughness": 4000,
		"power": "---",
		"range": "---",
		"characteristics": "---",
		"desc": "坚果：“人们想知道，经常被僵尸啃的感觉怎样？他们不知道，我有限的感官，只能让我感到一种麻麻的感觉，像是，令人放松的背部按摩。”"
	},
	{
		"id": 5,
		"name": "樱桃炸弹",
		"description": "樱桃炸弹，能以炸掉一定区域内所有僵尸。他们一种下就会立刻引爆，所有请把他们种在僵尸们的身边。",
		"toughness": 300,
		"power": 1800,
		"range": "自身为中心周围1.5格的圆",
		"characteristics": "立即生效",
		"desc": "“我要‘爆’开了，”樱桃一号说。“不，我们是要‘炸’开了！”它哥哥樱桃二号说。经过激烈的商议之后，它们才统一达成“爆炸”这个说法。"
	},
	{
		"id": 12,
		"name": "土豆雷",
		"description": "土豆雷具有强大的威力；但是他们需要点时间来武装自己。你应把他们种在僵尸前进的路上，当他们一被接触就会爆炸。",
		"toughness": 300,
		"power": 1800,
		"range": "自身所在格",
		"characteristics": "单独使用，需要15s的准备时间",
		"desc": "一些人说土豆雷很懒，因为他总是把所有事情留到最后。土豆雷才没空理他们，他正忙着考虑他的投资战略呢。"
	},
	{
		"id": 6,
		"name": "双发射手",
		"description": "双发射手可以一次发射两颗豌豆。",
		"toughness": 300,
		"power": "20×2点/1.4s",
		"range": "前方整行",
		"characteristics": "---",
		"desc": "双发射手很凶悍，他是在街头混大的。他不在乎任何人的看法，无论是植物还是僵尸，他打出豌豆，是为了让别人离他远点。其实呢，双发射手一直暗暗地渴望着爱情。"
	},
	{
		"id": 4,
		"name": "寒冰射手",
		"description": "寒冰射手会发射寒冰豌豆，来攻击敌人，并具有减速效果。",
		"toughness": 300,
		"power": "20×1点/1.4s",
		"range": "前方整行",
		"characteristics": "单体减速1/2，维持15s",
		"desc": "人们经常告诉寒冰射手他是多么“冷酷”，或者告诫他要“冷静”。他们叫他要“保持镇静”。寒冰射手只是转转他的眼睛，其实他都听见了。"
	},
	{
		"id": 14,
		"name": "食人花",
		"description": "食人花可以一口吞掉一整只僵尸，但是他们消化僵尸的时候很脆弱。",
		"toughness": 300,
		"power": "对巨人40，对可吞下的僵尸即死",
		"range": "前方1.5格",
		"characteristics": "需要42s消化时间",
		"desc": "食人花几乎可以到“恐怖小店”表演它的绝技了，不过它的经济人榨取了它太多的钱，所以他没去成。尽管如此，食人花没有怨言，只说了句这只是交易的一部分。"
	},
	{
		"id": 9,
		"name": "小喷菇",
		"description": "小喷菇是免费的，不过射程很近。",
		"toughness": 300,
		"power": "20×1点/1.4s",
		"range": "前方3格",
		"characteristics": "---",
		"desc": "小喷菇：“我也是最近才知道僵尸的存在，和很多蘑菇一样，我只是把他们想象成童话和电影里的怪物。不过这次的经历已经让我大开眼界了。”"
	},
	{
		"id": 11,
		"name": "阳光菇",
		"description": "阳光菇开始提供少量阳光，稍后提供正常数量阳光。",
		"toughness": 300,
		"power": "---",
		"range": "---",
		"characteristics": "每24s生产15点阳光，120s长成后每24s生产25点阳光",
		"desc": "阳光菇讨厌阳光。恨到当它内部产生点阳光时，就尽可能快的吐出来。它就是不能忍受这个。对它来说，阳光令人厌恶。"
	},
	{
		"id": 38,
		"name": "大喷菇",
		"description": "大喷菇喷出的气液可以穿透铁丝网门。",
		"toughness": 300,
		"power": "20×1点/1.4s",
		"range": "前方4格的所有僵尸",
		"characteristics": "穿透攻击",
		"desc": "“我以前那份没前途的工作，是为一个面包房生产酵母孢，”大喷菇说。“然后小喷菇，上帝保佑它，告诉了我这个喷杀僵尸的机会。现在我真觉得自己完全不同了。”"
	},
	{
		"id": 39,
		"name": "墓碑吞噬者",
		"description": "墓碑吞噬者用来吃掉墓碑。",
		"toughness": 300,
		"power": "---",
		"range": "---",
		"characteristics": "需要种在墓碑上",
		"desc": "尽管墓碑吞噬者的外表十分吓人，但他想要所有人都知道，其实他喜欢小猫咪，而且利用业余时间，在一家僵尸康复中心做志愿者。“我只是在做正确的事情，”他说。"
	},
	{
		"id": 28,
		"name": "魅惑菇",
		"description": "当僵尸吃下魅惑菇后，他将会掉转方向为你作战。",
		"toughness": 300,
		"power": "---",
		"range": "单个僵尸",
		"characteristics": "催眠吃下自己的一只僵尸使之为你作战",
		"desc": "魅惑菇声称：“僵尸们是我们的朋友，他们被严重误解了，僵尸们在我们的生态环境里扮演着重要角色。我们可以也应当更努力地让他们学会用我们的方式来思考。”"
	},
	{
		"id": 13,
		"name": "胆小菇",
		"description": "胆小菇是一种远程射手，敌人接近后会躲起来。",
		"toughness": 300,
		"power": "20×1点/1.4s",
		"range": "前方整行",
		"characteristics": "以自身为圆心周围约1.5格内有僵尸时会躲起来停止攻击",
		"desc": "胆小菇很害羞。这不对，他非常非常害羞。每次有人看到他，他都会极度慌乱。没人知道他为什么如此紧张，他自己也不知道。"
	},
	{
		"id": 16,
		"name": "冰菇",
		"description": "冰菇可以冻住所有僵尸。",
		"toughness": 300,
		"power": "---",
		"range": "全屏幕范围",
		"characteristics": "冻结僵尸10秒，减速20秒",
		"desc": "冰菇讨厌暖气，它真是受不了。每当看到有人打开暖气，它就忍不住从心底涌上一股寒冷。"
	},
	{
		"id": 22,
		"name": "毁灭菇",
		"description": "毁灭菇可以摧毁大量僵尸。",
		"toughness": 300,
		"power": "---",
		"range": "以自身为圆心，周围约1.5格的僵尸",
		"characteristics": "只能使用一次，导致自身区域永久性地块无法种植植物",
		"desc": "毁灭菇并不认为僵尸是恶意的。僵尸们只是像他一样，被束缚在自己的坏习惯中。毁灭菇努力戒掉自毁的冲动，但成功的机会渺茫。"
	},
	{
		"id": 10,
		"name": "巨型墙果",
		"description": "巨型墙果拥有坚不可摧的防御力。",
		"toughness": 8000,
		"power": "---",
		"range": "---",
		"characteristics": "---",
		"desc": "巨型墙果是个沉默的巨人。他不会说太多话，总是安静的待在自己的角落里。但是，墙果周围的植物知道他在，知道他会保护他们。"
	},
	{
		"id": 42,
		"name": "睡莲",
		"description": "睡莲可以让你种植非水生植物在它上面。",
		"toughness": 300,
		"attack": "---",
		"speed": "---",
		"characteristics": "栽种于水面，可在上面种植植物",
		"desc": "睡莲从不抱怨，它也从来不想知道发生了什么事。在它身上种植物，它也不会说什么。难道，它有什么惊奇想法或者可怕的秘密？没人知道。睡莲把这些都埋藏在心底。"
	},
	{
		"id": 8,
		"name": "窝瓜",
		"description": "窝瓜会压扁第一个接近它的僵尸。",
		"toughness": 300,
		"attack": 1800,
		"speed": "---",
		"characteristics": "身后极小范围及正前方约1.5格",
		"desc": "“我准备好了！”窝瓜大吼道，“干吧！算我一份；没人比我厉害，我就是你要的人！来啊！还等什么？要的就是这个。”"
	},
	{
		"id": 27,
		"name": "三线射手",
		"description": "三线射手可以在三条线上同时射出豌豆。",
		"toughness": 300,
		"attack": "20×1点/1.4s",
		"speed": "---",
		"characteristics": "自身所在及上下共3行",
		"desc": "三线射手喜欢读书、下棋和在公园里傻坐着，他也喜欢演出，特别是现代爵士乐。“我正在寻找我生命中的另一半，”他说。三线射手最爱的数字是5。"
	},
	{
		"id": 21,
		"name": "缠绕水草",
		"description": "缠绕水草是一种可以把接近他的僵尸拉进水中的水生植物。",
		"toughness": 300,
		"attack": "(即死)",
		"speed": "---",
		"characteristics": "将1只僵尸拉下水",
		"desc": "“我是完全隐形的”缠绕水草琢磨着，“我就藏匿在水面下，没人会看到我。”他的朋友告诉他，他们可以清楚地看到他。不过，缠绕水草仍保留了自己的看法。"
	},
	{
		"id": 7,
		"name": "火爆辣椒",
		"description": "火爆辣椒可以摧毁一整条线上的敌人。",
		"toughness": 300,
		"attack": 1800,
		"speed": "---",
		"characteristics": "摧毁冰道，抵消冰减速",
		"desc": "“嘎嘎嘎嘎！”火爆辣椒说：“他现在不会爆炸，还不到时候”不过快了，喔！快了快了，快来了。他知道，他感受到了，它一生都是在等待这一刻！"
	},
	{
		"id": 15,
		"name": "地刺",
		"description": "地刺可以扎破轮胎，并对踩到他的僵尸造成伤害。",
		"toughness": 300,
		"attack": "20×1点/1s",
		"speed": "---",
		"characteristics": "扎破轮胎",
		"desc": "地刺痴迷冰球，它买了包厢的季票。他一直关注着它喜欢的球员，它也始终如一的在赛后清理冰球场。但只有一个问题：它害怕冰球。"
	},
	{
		"id": 26,
		"name": "火炬树桩",
		"description": "火炬树桩可以把穿过他的豌豆变成火球，可以造成两倍伤害。",
		"toughness": 300,
		"attack": "---",
		"speed": "---",
		"characteristics": "将穿过的豌豆变成火球，火球伤害40(取消冰减速效果)对其后僵尸造成13溅射伤害；可以小范围开雾，范围为自身为中心的十字",
		"desc": "每个人都喜欢和拥戴火炬树桩，他们喜欢他的诚实和坚贞的友谊，以及增强豌豆伤害的能力。但它也有“不能说的秘密”：它不识字！"
	},
	{
		"id": 10,
		"name": "高坚果",
		"description": "高坚果是重型壁垒植物，而且不会被跨过。",
		"toughness": 8000,
		"attack": "---",
		"speed": "---",
		"characteristics": "---",
		"desc": "人们都想知道，坚果和高坚果是否在竞争。高坚果以男中音的声调大声笑了。“我们之间怎么会存在竞争关系？我们是哥们儿。你知道坚果为我做了什么吗…”高坚果的声音越来越小，它狡黠地笑着。"
	},
	{
		"id": 20,
		"name": "海蘑菇",
		"description": "海蘑菇能够发射短程孢子的水生植物。",
		"toughness": 300,
		"attack": "20×1点/1.4s",
		"speed": "---",
		"characteristics": "水生植物",
		"desc": "海蘑菇从来目睹过大海，大海仅在它的名字里。它总听到有关于大海的传闻。只是没有合适的时间，总有一天……是的，它会亲眼遥望大海的。"
	},
	{
		"id": 20,
		"name": "路灯花",
		"description": "路灯花能照亮一片区域，让你看清战场迷雾。",
		"toughness": 300,
		"attack": "---",
		"speed": "---",
		"characteristics": "开雾；自身为中心7×5格",
		"desc": "路灯花抵触科学，它只会埋头蛮干。其他植物吃的是光，挤出的是氧气。路灯花吃的是黑暗，挤出的却是光。对于它如何能产生光这件事，路灯花持谨慎态度。“我不会说这是‘巫术’，我也不会使用‘黑暗力量’，我只是……我想我说得够多的了。”"
	},
	{
		"id": 18,
		"name": "仙人掌",
		"description": "仙人掌发射的穿刺弹可以用来打击地面和空中目标。",
		"toughness": 300,
		"attack": "20×1点/1.4s",
		"speed": "---",
		"characteristics": "优先击落气球",
		"desc": "确实，仙人掌非常‘刺儿’，但是她的刺下，隐藏藏着颗温柔的心，充满着爱和善良。她只是想拥抱别人，和被别人拥抱。大多数人都做不到这点，但是仙人掌她并不介意。她注视着一只铠甲鼠良久，这次好像真的可以抱抱了。"
	},
	{
		"id": 43,
		"name": "三叶草",
		"description": "三叶草能吹走所有的气球僵尸，也可以把雾吹散。",
		"toughness": 300,
		"attack": "---",
		"speed": "---",
		"characteristics": "吹走全屏的气球和雾；开雾时间24s",
		"desc": "当三叶草五岁生日的时候，他得到了一个闪亮的生日蛋糕。他许好愿，然后深吸一口气却只吹灭了60%的蜡烛。然而他没有放弃，小时候的那次失败促使他更加努力直到现在。"
	},
	{
		"id": 30,
		"name": "裂荚射手",
		"description": "裂荚射手可以向前后两个方向发射豌豆。",
		"toughness": 300,
		"attack": "前方：20×1点/1.4s；后方：20×2点/1.4s",
		"speed": "---",
		"characteristics": "---",
		"desc": "裂荚射手：“没错，我就是双子座。我知道这确实令人匪夷所思。不过，有两个头，或者实际上，长着一个头和一个类似头的东西，在背上，对我这条线上的防守帮助很大。”"
	},
	{
		"id": 45,
		"name": "杨桃",
		"description": "杨桃可以向五个方向发射小杨桃。",
		"toughness": 300,
		"attack": "20×1点/1.4s",
		"speed": "---",
		"characteristics": "五个方向",
		"desc": "杨桃：“嘿，哥们，有一天我去看牙医，他说我有四个牙洞。我一数，我就只有一颗牙齿！一颗牙齿长了四个牙洞？怎么会这样啊？”"
	},
	{
		"id": 45,
		"name": "南瓜壳",
		"description": "南瓜壳可以用它坚硬的壳保护自身免受伤害。",
		"toughness": 300,
		"attack": "---",
		"speed": "---",
		"characteristics": "南瓜壳可以抵挡一部分伤害",
		"desc": "南瓜壳很喜欢秋天。它总是感觉特别的温暖和舒适。它也有小小的担忧，它希望每年的丰收节都能多给它带来点儿运气。虽然它并不在意这是否会发生，它会感到特别开心的。"
	}, {
		"id": 29,
		"name": "磁力菇",
		"description": "磁力菇可以用磁力吸取僵尸的头盔等其它金属物品。",
		"toughness": 300,
		"power": "---",
		"range": "自身为中心周围3格的圆",
		"characteristics": "移除僵尸身上的金属",
		"desc": "磁力是一种强大的力量；非常强大，强大到有时都吓到磁力菇自己了。能力越大，责任越大，他不知道自己能否肩负得起这重担。"
	},
	{
		"id": 24,
		"name": "卷心菜投手",
		"description": "卷心菜投手可以投掷卷心菜。",
		"toughness": 300,
		"power": "40×1点/2.9s",
		"range": "正前方整行",
		"characteristics": "投掷无视屋面角度",
		"desc": "卷心菜投手用卷心菜砸僵尸干得很好，它以此赚钱，毕竟，它擅长这个。只是首先他不明白僵尸们是怎么爬上屋顶的。"
	},
	{
		"id": 41,
		"name": "花盆",
		"description": "花盆可以让你在屋顶上种植植物。",
		"toughness": 300,
		"power": "---",
		"range": "---",
		"characteristics": "可以让你在屋顶上种植植物。",
		"desc": "“我是一个让植物栽种的花盆，但我也是一棵植物。是不是很意外？”"
	},
	{
		"id": 23,
		"name": "玉米投手",
		"description": "玉米投手，可以投掷玉米粒和黄油。",
		"toughness": 300,
		"power": "黄油：40×1点/2.9s（固定僵尸4s）\n玉米粒：20×1点/2.9s",
		"range": "正前方整行",
		"characteristics": "投掷无视屋面角度",
		"desc": "玉米投手是投手兄弟中的老大；他们三兄弟当中，只有玉米记得其它人的生日，只不过它记得不太准而已。"
	},
	{
		"id": 37,
		"name": "咖啡豆",
		"description": "咖啡豆，可以唤醒睡眠中的蘑菇们。",
		"toughness": 300,
		"power": "---",
		"range": "---",
		"characteristics": "种植在睡觉的蘑菇上唤醒蘑菇",
		"desc": "咖啡豆：“嘿，伙计们！嘿，怎么回事？是谁？嘿！你瞧见那个玩意了没？什么东西？哇，“是狮子”！嗯，咖啡豆深信这样可以让自己兴奋。”"
	},
	{
		"id": 33,
		"name": "大蒜",
		"description": "大蒜可以让僵尸改变前进的路线。",
		"toughness": 400,
		"power": "---",
		"range": "---",
		"characteristics": "强制使啃食过自己的僵尸改道至相邻的一行",
		"desc": "路线转向；这不仅仅是大蒜的专业，更是它的热情所在。他在布鲁塞尔大学里，获得了转向学的博士学位。"
	},
	{
		"id": 46,
		"name": "叶子保护伞",
		"description": "叶子保护伞保护着邻近的植物不被蹦极僵尸和投石车僵尸所伤害。",
		"toughness": 300,
		"power": "---",
		"range": "自身为中心及周围8格",
		"characteristics": "保护着邻近的植物不被蹦极僵尸和投石车僵尸所伤害。",
		"desc": "叶子保护伞：“砰！你喜欢这样不，我还可以做给你瞧。砰！哇！我快速向上张开我的叶子，来保护我的邻居。耶！就是这样。没错，就是这样，相信我。"
	},
	{
		"id": 31,
		"name": "金盏花",
		"description": "金盏花可以提供金币和银币。",
		"toughness": 300,
		"power": "---",
		"range": "---",
		"characteristics": "每24s生产一个银币或金币",
		"desc": "金盏花耗费了许多时间；来考虑是吐出一枚金币，还是吐出一枚银币。她权衡着各个角度，不停地思索着。她做了坚实的研究，并且，继续出版她当前的研究成果。"
	},
	{
		"id": 19,
		"name": "西瓜投手",
		"description": "西瓜投手可以对成群的僵尸造成巨大伤害。",
		"toughness": 300,
		"power": "80×1点/2.9s，对周围的僵尸附带溅射伤害26",
		"range": "正前方整行",
		"characteristics": "投掷无视屋面角度",
		"desc": "低调从来不是西瓜投手的风格，“太阳——赐予我——力量，我可是草地上最能打的人”，他说“我不是吹牛，瞅瞅那些统计数据，你就会明白了。”"
	},
	{
		"id": 34,
		"name": "机枪射手",
		"description": "机枪射手可以一次发射四颗豌豆",
		"toughness": 300,
		"power": "20×4点/1.4s",
		"range": "正前方整行",
		"characteristics": "只可用于升级双发豌豆",
		"desc": "当机枪射手宣布它要服役的时候，它的父母很为它担心，他们异口同声地对他说：“亲爱的，但这太危险了。”机枪射手拒绝妥协，“生活本就是危险的，”它这样回答，此时它的眼睛里，正闪烁着钢铁般的信念。"
	},
	{
		"id": 32,
		"name": "双子向日葵",
		"description": "双子向日葵的阳光产量是普通向日葵的两倍。",
		"toughness": 300,
		"power": "---",
		"range": "---",
		"characteristics": "每24s生产50点阳光，只可用于升级向日葵",
		"desc": "这是一个疯狂的夜晚，禁忌的科学技术，让双子向日葵来到了这个世界。电闪雷鸣，狂风怒吼，这个世界对它的到来都表示抗议。但是这一切都于事无补，双子向日葵它仍然高调的活着！"
	},
	{
		"id": 44,
		"name": "忧郁蘑菇",
		"description": "忧郁蘑菇围绕自身释放大量烟雾",
		"toughness": 300,
		"power": "20×4点/1.9s",
		"range": "自身为中心周围8格",
		"characteristics": "只可用于升级大喷菇",
		"desc": "“我一直喜欢释放大量氤氲”忧郁蘑菇说。“我知道很多人受不了这样，它们说这样：“很低俗很恶臭”。我只能说，你们更想被僵尸啃掉脑壳么？”"
	},
	{
		"id": 25,
		"name": "香蒲",
		"description": "攻击任何线上的僵尸以及气球僵尸",
		"toughness": 300,
		"power": "20×2点/1.4s",
		"range": "全屏幕",
		"characteristics": "只可用于升级睡莲，每次攻击发射两枚刺(两次可分别攻击不同目标)，优先攻击离自身最近的目标，最优先击落气球",
		"desc": "“嗷！”香蒲说：“嗷！嗷！嗷！这让你困惑么？你不会就因为我名字里有猫，还有我看着像只猫就期待我喵喵喵的叫？这里可不是动物园。”"
	}, {
		"id": 40,
		"name": "吸金磁",
		"description": "吸金磁可以为你收集硬币和钻石。",
		"toughness": 300,
		"power": "---",
		"range": "全屏幕",
		"characteristics": "只可用于升级磁力菇",
		"desc": "“我怎么能在这虚度此生？”吸金磁说道，“怎么说我曾经也是坐在办公室的，还有我的福利，股票、期货。我曾经也算是中美公司副总裁！现在呢？我却蹲在这个破草丛的旮旯里，担忧随时会被僵尸嚼烂的命运！喔——等等，有枚硬币！”"
	},
	{
		"id": 0,
		"name": "玉米加农炮",
		"description": "点击玉米加农炮发射致命的玉米炮弹。",
		"toughness": 300,
		"power": 1800,
		"range": "手动发射，摧毁点击区域的僵尸",
		"characteristics": "必须种植在两个相邻的玉米投手上，上弹时间35秒",
		"desc": "玉米加农炮到底是怎样？嗯—它曾经在哈佛深造，并就职于纽约一家著名的律师事务所。众所周知，它发射一次农炮就能大范围歼灭僵尸，不过话说回来，是什么激发了它？"
	},
	{
		"id": 0,
		"name": "模仿者",
		"description": "模仿者允许你在同一个关卡使用两份相同的植物。",
		"toughness": "---",
		"power": "---",
		"range": "---",
		"characteristics": "---",
		"desc": "---"
	}, {
		"id": 35,
		"name": "“冰”瓜",
		"description": "“冰”瓜可以造成范围性伤害并让僵尸减速",
		"toughness": 300,
		"power": "80×1点/2.9s",
		"range": "正前方整行",
		"characteristics": "只可用于升级西瓜投手，对成群僵尸造成溅射伤害26，并附带冰减速",
		"desc": "“冰”瓜试着让自己紧绷的神经冷静下来，他听到僵尸的步步逼近。它真能做到么？有人能做到么？"
	}, {
		"id": 36,
		"name": "地刺王",
		"description": "地刺王可以扎破多个轮胎，并对踩到他的僵尸造成伤害。",
		"toughness": 450,
		"power": "20×2点/1s",
		"range": "自身所在格",
		"characteristics": "抗即死效果，只可用于升级地刺，不会被砸扁",
		"desc": "地刺王刚刚从欧洲旅行回来；在玩的尽兴同时也结识了很多逗趣的人。这增长了它的见识——它从来不知道，他们建造了这么大的博物馆，有如此多的艺术创作，这对它而言太神奇了。"
	}

]
zombies = [
	{
		"id": 1,
		"name": "普通僵尸",
		"description": "普通僵尸，是僵尸军团中的基础单位。它们行走缓慢，攻击力一般。",
		"toughness": 270,
		"attack": 100,
		"speed": "慢",
		"characteristics": "无特殊能力",
		"desc": "普通僵尸的智力与其他僵尸相比，并没有什么特别。它们无所畏惧，也不知道疲倦。或者只是单纯的没想那么多。"
	},
	{
		"id": 2,
		"name": "路障僵尸",
		"description": "路障僵尸拥有额外的防护。它们头上戴着一个路障，能够承受更多伤害。",
		"toughness": 540,
		"attack": 100,
		"speed": "慢",
		"characteristics": "具有额外防护",
		"desc": "路障僵尸觉得自己很特别，因为头上戴了一个路障。它认为这让它在僵尸群中显得与众不同。"
	},
	{
		"id": 3,
		"name": "铁桶僵尸",
		"description": "铁桶僵尸比路障僵尸拥有更强的防御力。它头上戴着一个坚固的铁桶。",
		"toughness": 1370,
		"attack": 100,
		"speed": "慢",
		"characteristics": "防御力极强",
		"desc": "铁桶僵尸爱它的铁桶，铁桶让它觉得无敌，但其实它内心还是有点不安的。"
	},
	{
		"id": 4,
		"name": "旗帜僵尸",
		"description": "旗帜僵尸带领僵尸军团进攻。它本质上和普通僵尸一样，只是手上多了面旗子。",
		"toughness": 270,
		"attack": 100,
		"speed": "慢",
		"characteristics": "召唤更多僵尸",
		"desc": "旗帜僵尸觉得自己肩负着重要的使命，虽然它也说不清楚这面旗子到底意味着什么。"
	},
	{
		"id": 8,
		"name": "撑杆跳僵尸",
		"description": "撑杆跳僵尸能够跳过一株植物，快速接近你的房子。",
		"toughness": 340,
		"attack": 100,
		"speed": "快",
		"characteristics": "跳过第一株植物",
		"desc": "撑杆跳僵尸是运动健将，它的撑杆跳能力使它在僵尸军团中脱颖而出。它非常自豪地展示自己的技能。"
	},
	{
		"id": 6,
		"name": "铁门僵尸",
		"description": "铁门僵尸头上扛着一个铁门，它可以用这个门挡住豌豆等攻击。",
		"toughness": 1370,
		"attack": 100,
		"speed": "慢",
		"characteristics": "具有防护能力，可挡豌豆攻击",
		"desc": "铁门僵尸总是被嘲笑，因为它总是把一扇门带在身上，但它一点都不在乎，它认为这能保证它的安全。"
	},
	{
		"id": 7,
		"name": "读报僵尸",
		"description": "读报僵尸拥有一个报纸用作护盾。失去报纸后，它会愤怒并加快速度。",
		"toughness": 340,
		"attack": 100,
		"speed": "慢，失去报纸后为快",
		"characteristics": "失去报纸后速度增加",
		"desc": "读报僵尸很喜欢读报纸，一旦它的报纸被打掉，它就会大怒并冲向敌人。"
	},
	{
		"id": 5,
		"name": "橄榄球僵尸",
		"description": "橄榄球僵尸是僵尸中的精英单位，它具有极高的生命值和快速的移动速度。",
		"toughness": 1650,
		"attack": 100,
		"speed": "快",
		"characteristics": "高防御，移动速度快",
		"desc": "橄榄球僵尸是僵尸军团中的明星选手，它热爱比赛，甚至在面对豌豆射手时也能保持兴奋。"
	},
	{
		"id": 28,
		"name": "雪人僵尸",
		"description": "雪人僵尸是一种罕见的僵尸，它的防御能力强，并且喜欢突然出现。",
		"toughness": 2000,
		"attack": 100,
		"speed": "慢",
		"characteristics": "高防御，移动速度慢",
		"desc": "雪人僵尸喜欢在不被预期的时刻出现，给你制造一些惊喜——或者麻烦。"
	},
	{
		"id": 16,
		"name": "舞王僵尸",
		"description": "舞王僵尸可以召唤伴舞僵尸，快速接近你的防线。",
		"toughness": 270,
		"attack": 100,
		"speed": "慢",
		"characteristics": "召唤伴舞僵尸",
		"desc": "舞王僵尸沉迷于舞蹈，它认为自己在僵尸中是最有风度的那个。"
	},
	{
		"id": 17,
		"name": "伴舞僵尸",
		"description": "伴舞僵尸是舞王僵尸召唤出来的，它们会配合舞王的步伐前进。",
		"toughness": 270,
		"attack": 100,
		"speed": "慢",
		"characteristics": "由舞王僵尸召唤",
		"desc": "伴舞僵尸非常听从舞王的指挥，它们忠实地跟随舞王的节奏，毫无怨言。"
	}, {
		"id": 19,
		"name": "disco僵尸",
		"description": "disco僵尸僵尸可以召唤伴舞僵尸，快速接近你的防线。",
		"toughness": 270,
		"attack": 100,
		"speed": "慢",
		"characteristics": "召唤伴舞僵尸",
		"desc": "disco僵尸僵尸沉迷于舞蹈，它认为自己在僵尸中是最有风度的那个。"
	},
	{
		"id": 20,
		"name": "disco伴舞僵尸",
		"description": "伴舞僵尸是舞王僵尸召唤出来的，它们会配合舞王的步伐前进。",
		"toughness": 270,
		"attack": 100,
		"speed": "慢",
		"characteristics": "由舞王僵尸召唤",
		"desc": "伴舞僵尸非常听从舞王的指挥，它们忠实地跟随舞王的节奏，毫无怨言。"
	},
	{
		"id": 22,
		"name": "气球僵尸",
		"description": "气球僵尸可以飞过你的防线，普通植物无法对其造成伤害，除非有特定的攻击手段。",
		"toughness": 270,
		"attack": 100,
		"speed": "慢",
		"characteristics": "飞行，可以避开普通攻击",
		"desc": "气球僵尸非常喜欢它的气球，凭借它的飞行优势，气球僵尸自认为是无法被阻挡的。"
	},
	{
		"id": 23,
		"name": "矿工僵尸",
		"description": "矿工僵尸会从你的防线后方挖掘出来，绕过前线植物。",
		"toughness": 340,
		"attack": 100,
		"speed": "快",
		"characteristics": "从后方出现",
		"desc": "矿工僵尸很喜欢从后方出击，它认为这是最聪明的攻击方式。它总是沾沾自喜地看着植物们手足无措。"
	},
	{
		"id": 21,
		"name": "跳跳僵尸",
		"description": "跳跳僵尸能跳跃过你的防守。",
		"toughness": 500,
		"attack": 100,
		"speed": "弹跳时约1.9s/格, 步行约3.8s/格",
		"characteristics": "跃过植物",
		"weakness": ["磁力菇", "高坚果"],
		"desc": "蹦！蹦！蹦！那是跳跳僵尸发出的有力且有效地声音。"
	},
	{
		"id": 0,
		"name": "蹦极僵尸",
		"description": "蹦极僵尸从天上攻击。",
		"toughness": 450,
		"attack": 0,
		"speed": "普通",
		"characteristics": "从天而降并窃取你的植物",
		"weakness": [],
		"desc": "蹦极僵尸最爱冒险。毕竟，如果你不再活着，那再体验次死亡又有何妨呢？"
	},
	{
		"id": 18,
		"name": "梯子僵尸",
		"description": "梯子僵尸能爬过障碍物。",
		"toughness": 1000,
		"attack": 100,
		"speed": "拿梯时约2s/格, 失去梯子约4-7s/格",
		"characteristics": "用梯子爬过障碍物",
		"weakness": ["大喷菇", "磁力菇"],
		"desc": "这架梯子花了他$8.99。"
	},
	{
		"id": 15,
		"name": "投石车僵尸",
		"description": "投石车僵尸操作着重型机器。",
		"toughness": 850,
		"attack": {
			"crush": 50,
			"basketball": 75
		},
		"speed": "约2.5s/格",
		"characteristics": "对植物投掷篮球",
		"desc": "投石车僵尸可以利用弹射器来发射任何东西，但篮球似乎是绝佳选择。"
	},
	{
		"id": 26,
		"name": "伽刚特尔",
		"description": "伽刚特尔是一种巨型僵尸。",
		"toughness": 3000,
		"attack": 50,
		"speed": "约4-7s/格",
		"characteristics": "当生命低于一半时投掷小鬼",
		"desc": "当伽刚特尔走动的时候，大地在震颤。当他悲叹的时候，所有的僵尸都沉寂了。他是僵尸们梦想成为的偶像。不过呢，他到现在还没交到女朋友。"
	},
	{
		"id": 25,
		"name": "红眼伽刚特尔",
		"description": "红眼伽刚特尔是一种巨型僵尸。",
		"toughness": 6000,
		"attack": 50,
		"speed": "约4-7s/格",
		"characteristics": "当生命低于一半时投掷小鬼",
		"desc": "当红眼伽刚特尔走动的时候，大地在震颤。当他悲叹的时候，所有的僵尸都沉寂了。他是僵尸们梦想成为的偶像。不过呢，他到现在还没交到女朋友。"
	},
	{
		"id": 14,
		"name": "小淘气",
		"description": "小淘气们是一群小型僵尸，他们被伽刚特尔用来投掷进你的防御体系。",
		"toughness": 270,
		"attack": 100,
		"speed": "约4-7s/格",
		"characteristics": "投掷到平地左数2、3、4列或屋顶左数2、3、4、5列",
		"desc": "小淘气虽然瘦小，但它确精通僵尸功夫，僵尸空手道和僵尸跆拳道。此外，它还会吹口琴。"
	},
	{
		"id": 0,
		"name": "僵王博士",
		"description": "僵王博士统领所有的僵尸。",
		"toughness": 40000,
		"attack": {
			"zombie_spawn": "释放僵尸",
			"ice_fire_ball": "冰/火球(范围一行，即死)-使用辣椒/寒冰菇",
			"car_crush": "砸车(范围2×3，即死)-无解，踩扁前排植物"
		},
		"speed": "慢",
		"characteristics": "统领僵尸",
		"desc": "僵王·乔治·埃德加只花了两年就获得了死亡学的博士学位，很快就掌握了死亡学的技术，他制造了一只恐怖的巨型僵尸机器人，着手建立起一个独裁的地方势力。"
	}, {
		"id": 9,
		"name": "鸭子救生圈僵尸",
		"description": "鸭子救生圈能让僵尸能浮在水面上。",
		"toughness": 270,
		"damage": "100点/s",
		"speed": "约4-7s/格",
		"characteristics": "只在水池关卡出现",
		"desc": "只有特定的僵尸才能成为救生圈僵尸，这可不是每个水货僵尸都能胜任的。有些救生圈有点漏气，但他们没能注意到，所以他们离开了，并摒弃了对脑子的渴求。"
	}, {
		"id": 12,
		"name": "路障鸭子救生圈僵尸",
		"description": "路障鸭子救生圈能让僵尸能浮在水面上。",
		"toughness": 640,
		"damage": "100点/s",
		"speed": "约4-7s/格",
		"characteristics": "只在水池关卡出现",
		"desc": "只有特定的僵尸才能成为救生圈僵尸，这可不是每个水货僵尸都能胜任的。有些救生圈有点漏气，但他们没能注意到，所以他们离开了，并摒弃了对脑子的渴求。"
	}, {
		"id": 10,
		"name": "铁桶鸭子救生圈僵尸",
		"description": "铁桶鸭子救生圈能让僵尸能浮在水面上。",
		"toughness": 1370,
		"damage": "100点/s",
		"speed": "约4-7s/格",
		"characteristics": "只在水池关卡出现",
		"desc": "只有特定的僵尸才能成为救生圈僵尸，这可不是每个水货僵尸都能胜任的。有些救生圈有点漏气，但他们没能注意到，所以他们离开了，并摒弃了对脑子的渴求。"
	},
	{
		"id": 11,
		"name": "潜水僵尸",
		"description": "潜水僵尸可以在水下前行。",
		"toughness": 270,
		"damage": "100点/s",
		"speed": "约4s/格",
		"characteristics": "潜泳以避免遭到攻击，只在水池关卡出现",
		"desc": "僵尸不呼吸，他们不需要空气，那么为什么潜水僵尸还需要一套噱头的潜水装置来潜水呢？答案：同行的压力。"
	},
	{
		"id": 13,
		"name": "造冰车僵尸",
		"description": "造冰车僵尸碾过你的植物，并留下一条冰道。",
		"toughness": 1350,
		"damage": "50（即死）",
		"speed": "约3-8s/格",
		"characteristics": "碾压植物，留下条冰道",
		"desc": "经常被误以为是在驾驶着造冰车的僵尸，但事实上造冰车僵尸是种完全不同的生物形式，他与太空兽人联系更紧密而不是僵尸。"
	},
	{
		"id": 0,
		"name": "雪橇僵尸小队",
		"description": "这些僵尸以四人小队形式出现。",
		"toughness": "300 + 270×4",
		"damage": "100点/s",
		"speed": "滑行约1.2s/格，弃车后约4-7s/格",
		"characteristics": "只在雪地里出现，佩戴雪橇",
		"desc": "雪橇僵尸小队尽力到达他们所要去的地方。他们互相依赖、分享脑子并共同训练成为一个合作无间的僵尸小队。"
	},
	{
		"id": 27,
		"name": "海豚骑士僵尸",
		"description": "海豚骑士僵尸善于利用你水池防御的弱点。",
		"toughness": 500,
		"damage": "100点/s",
		"speed": "骑乘约0.8s/格, 跳跃后约4-7s/格",
		"characteristics": "跃过他所碰到的第一株植物，只在水池关卡出现，弱点：高坚果",
		"desc": "那海豚其实也是个僵尸。"
	}, {
		"id": 24,
		"name": "玩偶匣僵尸",
		"description": "这种僵尸带着个会爆炸的潘多拉盒子。",
		"toughness": 500,
		"damage": "100点/s",
		"speed": "约2.2s/格",
		"characteristics": "打开玩偶匣会爆炸，爆炸伤害1800点（即死），范围为自身为中心周围1.5格的圆",
		"desc": "这种僵尸令人不寒而栗，不是因为他的冰冷身躯，而是因为他的疯狂。"
	},

]
